{
  "en": {
    "home.heading1": "Web Developer",
    "home.heading2": "UI Designer",
    "home.heading3": "Problem solver",
    "home.heading4": "Self-taught Coder",
    "home.button1": "Recent projects",
    "home.frontbannerline1": "Crafting creative web apps",
    "home.frontbannerline2": "since 2023!",
    "home.frontText1": "I specialize in building user-centric websites and web apps with React.js, Astro, Next.js, WordPress and modern design tools (Figma etc.). I bring clarity to digital experiences, whether it's clean code or clean layouts.",
    "home.header1": "Tech stack:",
    "home.frontText2": "I aim to craft websites and web apps that not only look great but also help businesses grow, reach more people and make a lasting impression.",
    "home.header2": "Check out my Github and CV:",
    "home.header4": "CVs",
    "home.buttonheader1": "General CV:",
    "home.buttonheader2": "CV for IT field:",
    "home.downloadbutton": "download",
    "home.header3": "Read how I transitioned into tech from scratch:",
    "home.button": "Learn more",
    "projects.header1": "Now Showing",
    "projects.pausebutton": "Pause",
    "projects.playbutton": "Play",
    "projects.fullscreenbutton": "Fullscreen",
    "projects.exitfullscreen": "Exit fullscreen",
    "projects.card1text": "A website for a local business in Rantasalmi, Finland. The website is built using React and Tailwind CSS. The website is fully responsive and includes a contact form and a map. User can change language between Finnish and English at any time.",
    "projects.card2text": "A shop extension for pnp-power.fi. The shop is built using Next.js and Tailwind CSS. Styles are fully responsive for customer use (admin board is not). The shop includes a cart and a checkout form. Admins have access to a dashboard where they can manage products, orders and newsletters.",
    "projects.card3text": "A website made with WordPress, for the purpose of selling berries. Responsive layout. Contact form. Theme: Astra. ",
    "projects.card4text": "A classic snake game made with JavaScript. Doesn't look the greatest but works really well. Comes with an extensive options menu. Game gets faster and backgrounds change as you play. Two soundtracks. ",
    "projects.livebutton": "Live",
    "projects.codebutton": "Code",
    "projects.skillsheader": "Honest self-review of coding skills:",
    "projects.nowlearning": "Now learning:",
    "about.header1": "About Me",
    "about.header2": "From Academia to Administration",
    "about.header3": "Learning by Doing",
    "about.header4": "On AI, Learning and Growth",
    "about.header5": "Who I Am",
    "about.intro": "Hey there! I'm Joni - a 32-year-old self-taught developer with a background in philosophy, sports sciences and sociology. I'm currently in a career transition, building my skills in web development while planning to launch my own digital business.",
    "about.academia": "I graduated from the University of Jyväskylä in 2019 with three master's degrees. Later I worked as a municipal sports secretary in Ilomantsi where I was coordinating and organizing youth and sports services. While the role had its challenges, I valued the opportunity to make a tangible difference. Over time my curiosity and drive led me towards new areas - especially technology and coding.",
    "about.learning": "I began to learn coding (websites) in late 2023. What started as a curiosity has become a daily commitment. I dedicate several hours each day to learning through projects - websites, small games and practical tools that solve real problems. I've discovered that hands-on challenges teach more than tutorials ever could, though I'm grateful to all great teachers who put their time into teaching others.",
    "about.philosophy": "I build things because I want them to work, not just look good.",
    "about.techstack": "My preferred languages are JavaScript, TypeScript and PHP. I'm comfortable working across the full stack using technologies like:",
    "about.techlist1": "HTML / CSS / TailwindCSS / Bootstrap",
    "about.techlist2": "Node.js / Express",
    "about.techlist3": "React.js / Next.js",
    "about.techlist4": "WordPress",
    "about.techlist5": "Firebase / Supabase",
    "about.techlist6": "SQL and NoSQL databases",
    "about.techlist7": "Git and version control",
    "about.languages": "I enjoy JavaScript for its versatility and TypeScript for type checking in larger projects. I've found PHP surprisingly effective for quick, practical backend development - particularly with WordPress and CMS projects.",
    "about.ai": "I embrace AI as a development tool. Not as a shortcut, but as a supplement to problem-solving and creativity. AI is best used for mundane tasks. I like to ask AI questions but never take its advice at face value. To me the key to becoming a better developer isn't avoiding tools - it's using them well and choosing the best tool for the job.",
    "about.growth": "My philosophy of growth is simple: focus on meaningful projects, challenge yourself and finish what you start. I've learned more from projects where I was completely lost and forced to think and focus deeply than from anything else.",
    "about.whoiam": "I'm a calm, introverted (but social) and curious person. I value deep thought and quiet focus, but I'm also not afraid to step outside my comfort zone. Coding has become a way for me to explore my potential - a space where I can experiment, fail, improve and build something useful.",
    "about.future": "Though I started late, I'm not in a rush and I don't think programming is going anywhere despite all the advancements in AI. I'm here for the long game, to keep learning, building and moving forward. I'm excited to see what the future holds and how I can contribute.",
    "about.portfolio": "If you want to see my previous portfolio or learn more about me or the process of learning to code, click here:",
    "contact.header1": "Contact Me",
    "contact.p1": "Call me or send me an email. I'll get back to you as soon as possible.",
    "navbar.home": "Home",
    "navbar.projects": "Projects",
    "navbar.about": "About",
    "navbar.contact": "Contact Me",
    "skills.javascript.description": "Advanced proficiency in ES6+ features and DOM manipulation.",
    "skills.typescript.description": "Experience with type systems and interfaces. Basic knowledge of generics and type inference.",
    "skills.react.description": "Proficient with hooks, context API and component lifecycle. Experience with Redux and state management, react npm packages.",
    "skills.nextjs.description": "Server-side rendering and static site generation. Understanding of routing and API integration.",
    "skills.tailwindcss.description": "Utility-first CSS framework for rapid UI development. Knowledge of responsive design and quick prototyping.",
    "skills.nodejs.description": "Backend development with Express, API integration. Capability to create basic RESTful APIs and utilize middleware.",
    "skills.firebase.description": "Authentication, Firestore and real-time databases. Understanding of cloud functions, triggers, rules and deployment.",
    "skills.wordpress.description": "Theme development and custom plugin integration. Ability to make changes to styles, themes and backend code.",
    "skills.git.description": "Proficient in Git and GitHub. Basic understanding of branching, merging, and version control. Scared of merge conflicts.",
    "skills.python.description": "Basic scripting and automation. Not much experience with Python, but I am learning. Looking forward to it!"
  },
  
  "fi": {
  "home.heading1": "Web-kehittäjä",
    "home.heading2": "UI-kehittäjä",
    "home.heading3": "Ongelmanratkaisija",
    "home.heading4": "Itseoppinut koodari",
  "home.button1": "Viimeisimmät projektit",
  "home.frontbannerline1": "Tyylikkäitä ja kekseliäitä",
  "home.frontbannerline2": "verkkosivuja vuodesta 2023!",
  "home.frontText1": "Erikoisalaani ovat käyttäjälähtöiset verkkosivustot ja -sovellukset React.js:n, Astron, Next.js:n, WordPressin ja nykyaikaisten suunnittelutyökalujen (esim. Figma) avulla. Tuon selkeyttä digitaalisiin kokemuksiin – olipa kyse sitten puhtaasta koodista tai selkeästä ulkoasusta.",
  "home.header1": "Teknologiat:",
  "home.frontText2": "Tavoitteenani on rakentaa sivustoja ja sovelluksia, jotka näyttävät hyvältä mutta myös tukevat liiketoiminnan kasvua, tavoittavat enemmän ihmisiä ja jättävät pysyvän vaikutuksen.",
  "home.header2": "Tutustu Github-sivuihini ja ansioluettelooni:",
  "home.header4": "CV:t",
  "home.buttonheader1": "Yleinen CV:",
  "home.buttonheader2": "IT-alan CV:",
  "home.downloadbutton": "lataa",
  "home.header3": "Lue, kuinka siirryin kunta-alalta teknologia-alalle:",
  "home.button": "Lue lisää",
  "projects.header1": "Nyt videolla esittelyssä:",
  "projects.pausebutton": "Pysäytä",
  "projects.playbutton": "Jatka",
  "projects.fullscreenbutton": "Koko näyttö",
  "projects.exitfullscreen": "Pienennä",
  "projects.card1text": "Sivusto rantasalmelaiselle yritykselle. Sivusto on rakennettu Reactilla ja Tailwind CSS:llä. Se on täysin responsiivinen ja sisältää yhteydenottolomakkeen sekä kartan. Käyttäjä voi milloin vain vaihtaa kielen suomeksi tai englanniksi.",
  "projects.card2text": "Verkkokauppalaajennus pnp-power.fi:lle. Rakennettu Next.js:llä ja Tailwind CSS:llä. Sivusto on responsiivinen sekä tietokoneilla että mobiililaitteilla (ylläpitonäkymä ei ole). Kaupassa on ostoskori ja tilauslomake. Ylläpitäjillä on oma hallintapaneeli, jossa voi hallita tuotteita, tilauksia ja uutiskirjeitä.",
  "projects.card3text": "WordPress-sivusto, joka on kehitelty marjojen myymistä varten. Responsiivinen ulkoasu. Yhteydenottolomake. Teema: Astra.",
  "projects.card4text": "Klassinen matopeli JavaScriptillä. Ulkoasu ei ole kummoinen, mutta peli toimii mainiosti. Laaja valikkoasetukset. Peli nopeutuu ja taustat vaihtuvat pelin edetessä. Kaksi ääniraitaa.",
  "projects.livebutton": "Live",
  "projects.codebutton": "Koodi",
  "projects.skillsheader": "Rehellinen arvio koodaustaidoistani:",
  "about.header1": "Tietoa minusta",
  "about.header2": "Yliopistosta kunta-alalle",
  "about.header3": "Oppimista tekemällä",
  "about.header4": "Tekoälystä, oppimisesta ja kasvusta",
  "about.header5": "Kuka olen",
  "about.intro": "Moikka! Olen Joni – 32-vuotias itseoppinut koodari, jolla on tausta filosofiassa, liikuntatieteissä ja sosiologiassa. Olen parhaillaan siirtymässä kunta-alalta teknologia-alalle, kehittämässä koodaustaitojani ja suunnittelemassa omaa digitaalista liiketoimintaa.",
  "about.academia": "Valmistuin Jyväskylän yliopistosta vuonna 2019 kolmella maisterin tutkinnolla. Myöhemmin toimin Ilomantsissa kunnan liikuntasihteerinä, jossa koordinoin ja järjestin nuoriso- ja liikuntapalveluja. Vaikka roolissa oli omat haasteensa, arvostin mahdollisuutta vaikuttaa asioihin konkreettisesti. Uteliaisuuteni ja motivaationi veivät minut ajan myötä uusille alueille – erityisesti teknologian ja koodauksen pariin.",
  "about.learning": "Aloitin koodaamisen (verkkosivut) harjoittelun loppuvuodesta 2023. Uteliaisuudesta alkanut harrastus on muuttunut päivittäiseksi tekemiseksi. Käytän useita tunteja päivittäin oppimiseen projektien kautta – sivustojen, pienpelien ja käytännön työkalujen rakentamiseen. Olen huomannut, että käytännön haasteet opettavat enemmän kuin yksikään johdantovideo, mutta olen toki kiitollinen kaikille loistaville opettajille, jotka panostavat koulutukseen ja oppimiseen.",
  "about.philosophy": "Rakennan asioita käytännönläheisesti ja toimivuus edellä, en siksi, että ne näyttäisivät hyvältä.",
  "about.techstack": "Suosikkikieleni ovat JavaScript, TypeScript ja PHP. Työskentelen sujuvasti niin frontend- kuin backend-puolella käyttäen muun muassa:",
  "about.techlist1": "HTML / CSS / TailwindCSS / Bootstrap",
  "about.techlist2": "Node.js / Express",
  "about.techlist3": "React.js / Next.js",
  "about.techlist4": "WordPress",
  "about.techlist5": "Firebase / Supabase",
  "about.techlist6": "SQL- ja NoSQL-tietokannat",
  "about.techlist7": "Git ja versionhallinta",
  "about.languages": "Pidän JavaScriptistä sen monipuolisuuden vuoksi. TypeScriptiä käytän kun haluan parempaa tyyppiturvaa isommissa projekteissa. Arvostan PHP-ohjelmointikielen helppokäyttöisyyttä backend-puolella. WordPress- ja CMS-projekteissa se on nopea ja käytännöllinen taustaratkaisu.",
  "about.ai": "Hyödynnän tekoälyä kehitystyössä työkaluna – en oikopolkuna, vaan luovuuden ja ongelmanratkaisun tukena. Parhaimmillaan tekoäly hoitaa tylsät rutiinit. Kysyn tekoälyltä usein, mutta en niele vastauksia pureksimatta. Minulle kehittymisen ydin ei ole työkalujen vältteleminen, vaan niiden viisas ja tarkoituksenmukainen käyttö.",
  "about.growth": "Filosofiani koodauspuolella on yksinkertainen: keskity merkityksellisiin projekteihin, haasta itseäsi ja vie asiat loppuun. Eniten olen oppinut projekteista, jotka ovat laittaneet taitoni ja suunnittelutaitoni äärimmilleen. Mitä enemmän ajattelua ja hämmennystä, sitä enemmän kehitystä",
  "about.whoiam": "Olen rauhallinen, introvertti (mutta sosiaalinen) ja utelias ihminen. Arvostan syvällistä ajattelua ja hiljaista keskittymistä, mutta en pelkää astua epämukavuusalueelle. Koodaus on minulle tapa tutkia omaa potentiaaliani – tila, jossa voin kokeilla, epäonnistua, kehittyä ja rakentaa jotain hyödyllistä.",
  "about.future": "Vaikka aloitin koodauksen melko myöhäisellä iällä, en aio pitää kiirettä. Ohjelmointi ei ole katoamassa tekoälyn myötä. Keskityn siihen, mikä on tärkeää pitkällä aikavälillä: oppiminen, uusien asioiden rakentaminen ja kehittyminen. Odotan innolla, että mitä tulevaisuus tuo tullessaan, mitä uusia taitoja voin oppia ja kuinka voin auttaa muita koodaustaidoillani.",
  "about.portfolio": "Jos haluat nähdä aiemman portfolioni tai lukea lisää minusta ja oppimisprosessistani, klikkaa tästä:",
  "contact.header1": "Ota yhteyttä",
  "contact.p1": "Soita tai lähetä sähköpostia. Vastaan sinulle mahdollisimman pian.",
  "navbar.home": "Etusivu",
  "navbar.projects": "Projektit",
  "navbar.about": "Tietoa minusta",
  "navbar.contact": "Ota yhteyttä",
  "skills.javascript.description": "Edistynyt osaaminen ES6+-ominaisuuksissa ja DOM-manipuloinnissa.",
  "skills.typescript.description": "Kokemusta tyyppijärjestelmistä ja rajapinnoista. Perustiedot geneerisistä tyypeistä ja tyyppipäätelmästä.",
  "skills.react.description": "Taitava hookien, context API:n, komponenttien kanssa. Kokemusta npm-paketeista, Reduxista, tilanhallinnasta.",
  "skills.nextjs.description": "Palvelinpuolen renderöinti ja staattisten sivujen generointi. Ymmärrystä reitityksestä ja API-integraatiosta.",
  "skills.tailwindcss.description": "Utility-first-tyylinen CSS-kehys nopeaan käyttöliittymäkehitykseen. Responsiivinen suunnittelu ja nopeat prototyypit.",
  "skills.nodejs.description": "Taustakehitystä Expressillä, API-integraatiot. Kykyä luoda perus-REST-rajapintoja ja hyödyntää middleware-ratkaisuja.",
  "skills.firebase.description": "Autentikointi, Firestore ja reaaliaikaiset tietokannat. Ymmärrystä pilvitoiminnoista, triggereistä, säännöistä ja käyttöönotosta.",
  "skills.wordpress.description": "Teemojen kehitys ja mukautettujen lisäosien integrointi. Kyky tehdä muutoksia tyyleihin, teemoihin ja taustakoodiin.",
  "skills.git.description": "Git-käyttöönotto, yhteistyö, haarojen ja pull-pyynnön käyttö. Ymmärrystä Git-työnkulusta ja versionhallinnasta. Yhdistämiskonfliktit pelottavat hieman.",
  "skills.python.description": "Perusskriptaus ja automaatio. Ei paljon kokemusta Pythonista, mutta olen oppimassa. Odotan innolla uusia projekteja!"
}

}
